{"pages":[],"posts":[{"title":"mesonbuild","text":"http://mesonbuild.com/Quick-guide.html安装 $ sudo apt-get install python3 python3-pip ninja-build $ pip3 install --user meson 运行 $ cd /path/to/source/root $ meson builddir &amp;&amp; cd builddir $ ninja $ ninja test http://mesonbuild.com/Tutorial.html简单的meson.buildproject(‘tutorial’, ‘c’)gtkdep = dependency(‘gtk+-3.0’)executable(‘demo’, ‘main.c’, dependencies : gtkdep) https://mesonbuild.com/Running-Meson.htmlmeson [command] [arguments] [options]meson setup builddir srcdirbuilddir是必须的。srcdir如果没有指定，会用meson.build所在目录 –buildtype选项: value meaning plain no extra build flags are used, even for compiler warnings, useful for distro packagers and other cases where you need to specify all arguments by yourself debug debug info is generated but the result is not optimized, this is the default debugoptimized debug info is generated and the code is optimized (on most compilers this means -g -O2) release full optimization, no debug info 默认使用ninja，可以用backend指定 meson setup build_dir --backend=vs2010 通过环境变量指定编译器和编译选项选项: Name Comment CFLAGS Flags for the C compiler CXXFLAGS Flags for the C++ compiler OBJCFLAGS Flags for the Objective C compiler FFLAGS Flags for the Fortran compiler DFLAGS Flags for the D compiler VALAFLAGS Flags for the Vala compiler RUSTFLAGS Flags for the Rust compiler LDFLAGS The linker flags, used for all languages 使用ninja编译 ninja -C builddir ninja -C builddir test ninja -C builddir install –prefix /your/prefix或者DESTDIR变量指定安装目录 DESTDIR=/path/to/staging ninja -C builddir install","link":"/2019/02/09/mesonbuild/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/02/08/hello-world/"},{"title":"跑步记录2019","text":"日期 地点 距离(km) 鞋子 2019/2/1 火车头体育场 16.77 Supernova ST 2019/2/3 火车头体育场 30.96 TriumphISO 3 2019/2/5 火车头体育场 21.50 Supernova ST 2019/2/6 火车头体育场 20.21 TriumphISO 3 2019/2/9 火车头体育场 33.11 Supernova ST","link":"/2019/02/09/跑步记录2019/"}],"tags":[],"categories":[]}